# ShapeFamilyId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShape..::..ShapeFamilyId Property
RebarShape Class See Also
---
Get and return the rebar shape family id.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId ShapeFamilyId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ShapeFamilyId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ShapeFamilyId {
	ElementId^ get ();
}
```

# See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace